//#include <stdio.h>
//
//void main() {
//    //打印1~100之间所有是9的倍数的整数的个数及总和. [使用for完成]
//    //分析
//    //1. 定义变量 count 记录 个数
//    //2. 定义变量 sum 记录 总和
//
////    int i = 0;
////    int count = 0;
////    int sum = 0;
////    for (i = 1; i <= 100; i++) {
////        //判断i是不是9的倍数
////        if (i % 9 == 0) {//是
////            count++;//统计个数
////            sum += i;//累计到sum
////        }
////    }
////    printf("count=%d sum=%d", count, sum);
//
//    //完成下面的表达式输出
//
//    //分析
//    //1.先接受用户的输入 num
//    //2.使用for循环来输出 0 => num的各种组合方式
//    //3.使用先死后活的方式来编程和思考，假定num就是6=>然后再把6改成变量
//    //4.当我们的编程思维建立后，就可以一步到位
//
//    int num = 6;//使用scanf让用户输入num
//    int i = 0;
//    for (i = 0; i <= num; i++) {
//        printf("%d + %d = %d\n", i, num - i, num);
//    }
//}
