//#include <stdio.h>
//
//void main() {
//
//    //处理的流程 10/4 = 2.5 ==截取整数 ==> 2 =>2.000000
//    double d1 = 10 / 4; //2
//    double d2 = 10.0 / 4;//如果希望保留小数，参与运算数必须有浮点数
//
//    //取模的公式
//    //a%b=a-a/b*b
//
//    int res1 = 10 % 3;//求10/3的余数
//    int res2 = -10 % 3;//=-10-(-10)/3*3= -10 - (-3)*3 = -10 + 9 = -1
//    int res3 = 10 % -3;//10-10/(-3)*(-3)=10-9=1
//    int res4 = -10 % -3;//-1
//
//    //++的使用
//    int i = 10;
//    int j = i++;//运算规则等价是 int j=i;i=i+1
//    printf("i=%d j=%d", i, j);//i=11,j=10
//
//    int k = ++i;//运算规则等价是i=i+1 int k=i
//
//    printf("\ni=%d k=%d", i, k);//i=12,k=12
//    printf("\nd1=%f d2=%f res1=%d res2=%d res3=%d res4=%d", d1, d2, res1, res2, res3, res4);
//
//    //++ 或者 --还可以独立使用，就相当于自增
//    //k++ 等价于 k=k+1
//    //++k 等价于 k=k+1
//    //如果独立使用 ++k和k++完全等价
//    k++;
//    ++k;
//    printf("\nk=%d",k); //k=14
//}
